[
  {
    "id": 1,
    "title": "Veenotes (alpha)",
    "year": "2024",
    "shortDescription": "The ultimate tool to learn more effectively from online videos.",
    "description": "Veenote is a React and Django-based application designed to enhance video-based learning. It allows users to bookmark key moments, add detailed notes, and organize videos into collections for a more structured learning experience. The app leverages modern web technologies to deliver a seamless and engaging interface, deployed on scalable platforms.",
    "images": [
      "veenotes--screen.png"
    ],
    "link": "https://veenotes.com/",
    "features": [
      "React.js frontend for a dynamic and intuitive user experience",
      "RESTful API powered by Django for managing videos, bookmarks, and collections",
      "Tailwind CSS for a responsive and customizable design system",
      "Seamless user authentication and management with Clerk integration",
      "Scalable deployment with Heroku and Netlify"
    ],
    "stack": [
      "React.js",
      "Django",
      "PostgreSQL",
      "Heroku",
      "Netlify",
      "Tailwind CSS",
      "TanStack Query"
    ],
    "figma": "https://www.figma.com/design/Z3oonXrdnYsifgVV64BFbi/VEENOTES?node-id=0-1&m=dev"
  },
  {
    "id": 5,
    "title": "Devjokes API",
    "year": "2024",
    "shortDescription": "A RESTful API that serves developer jokes.",
    "description": "Django-based Devjokes API as a side project with a react frontend for the API documentation. RESTful endpoints for jokes, deployed with an SQLite database to Heroku. A serverside script reloads the initial state of the database at every Dyno restart.",
    "images": [
      "devjokes-screen.png"
    ],
    "link": "https://devjokes.alexander-stoehr.de/",
    "features": [
      "React.js frontend that serves as a documentation and project showcase",
      "Postman collection for testing the API",
      "SQLite database for storing jokes"
    ],
    "stack": [
      "React.js",
      "Django",
      "SQLite",
      "Heroku",
      "Postman",
      "Netlify"
    ],
    "figma": "https://www.figma.com/design/JqGmQSm09jlSMRZMid3mNW/DevJokes?node-id=8756-2045&m=dev&t=itGDnKVVUeqZ83k7-1"
  },
  {
    "id": 4,
    "title": "HR Leave Management Tool",
    "year": "2024",
    "shortDescription": "Handle leave requests for your Team easily.",
    "description": "Final project for my 8-month intensive full stack course, creating a tool where HR and team managers can handle leave requests and keep track of employee absence. Employees can request vacations, trainings and file absence notices. Stack: React, Django, Postgres",
    "images": [
      "genie-screen.png"
    ],
    "link": "https://github.com/alexanderstoehr/HR-Leave-Management-Tool",
    "features": [
      "Advanced user hierarchy with different roles and permissions",
      "Email notifications for leave requests and approvals",
      "Calendar view for team managers to keep track of employee absence"
    ],
    "stack": [
      "React.js",
      "Django",
      "Postgres",
      "Heroku",
      "Netlify",
      "DigitalOcean Spaces"
    ],
    "figma": "https://www.figma.com/design/1PTopr0gPeOVwyRrMeGA8S/Final-Project?node-id=4771-2054&m=dev&t=7H4CFecfQjhByaK5-1"
  },
  {
    "id": 3,
    "title": "Cookbook API",
    "year": "2024",
    "shortDescription": "Manage and share recipes with Django API.",
    "description": "Django-based Cookbook API for managing and sharing culinary recipes, featuring RESTful endpoints, JWT authentication, and integration with DigitalOcean Spaces for media storage. Utilized Django Rest Framework and JWT authentication.",
    "images": [
      "cookbook-screen.png"
    ],
    "link": "https://github.com/alexanderstoehr/Cookbook-API",
    "features": [
      "JWT authentication for secure access to the API",
      "DigitalOcean Spaces for media storage",
      "Postman collection for testing the API"
    ],
    "stack": [
      "Django",
      "Postgres",
      "Heroku"
    ]
  },
  {
    "id": 2,
    "title": "rezensia.ch",
    "year": "2024",
    "shortDescription": "High sales, great UI, low support requests.",
    "description": "Frontend design, Wordpress implentation and custom JavaScript for rezensia.ch. From zero to five figures of sales within the first month through a good and working UI. \u2028\nHigh conversion rate, low support requests, awesome user feedback.",
    "images": [
      "rezensia-screen.png"
    ],
    "link": "https://rezensia.ch/",
    "features": [
      "Custom JavaScript for a better user experience",
      "Rating Calculator for users to find the right product",
      "Custom Wordpress theme (Elementor) for a unique design"
    ],
    "stack": [
      "Wordpress",
      "WooCommerce",
      "JavaScript"
    ],
    "figma": "https://www.figma.com/design/7mMryecW0bVtbSQ0a8T0cs/Rezensia?node-id=7-2759&m=dev&t=fAlTmyYPrHQzy8wh-1"
  },
  {
    "id": 1,
    "title": "Maklerverzeichnis",
    "year": "2023",
    "shortDescription": "Real estate listings: WordPress, ratings, business development.",
    "description": "Frontend design, implementation in WordPress, and business development. A Real estate agent listing platform with rating functionalities. The platform has good exposure and is helping homeowners to find a proficient real estate agent in their area.",
    "images": [
      "mvz-screen.png"
    ],
    "link": "https://maklerverzeichnis.ch/",
    "features": [
      "Rating functionalities for real estate agents",
      "Custom Wordpress theme for a unique design",
      "Business development for the platform"
    ],
    "stack": [
      "Wordpress",
      "WooCommerce",
      "JavaScript"
    ]
  }
]